_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидПоказателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаЦелевыхПоказателей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СпособыРасчетаЦелевыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НефинансовыйПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НефинансовыеПоказателиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказателиИПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаЦелевыхПоказателей</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_СпособыРасчетаЦелевыхПоказателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БюджетныеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОтчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаЦелевыхПоказателей</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_СпособыРасчетаЦелевыхПоказателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства/Forms/ЦелевыеПоказателиИРедакторФормул/Ext/Form/Module.bsl
&НаКлиенте
Перем ЗакрытиеФормы;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПоместитьДанныеДляРедактированияНаСервере()
	
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства_ПоместитьДанныеДляРедактированияНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьДанныеВОбъектНаСервере(Формула)
	
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства_ПоместитьДанныеВОбъектНаСервере(ЭтотОбъект, Формула);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем СпособЗаполненияСтатьи;
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	//ДанныеОбъекта = Справочники.ЭлементыФинансовыхОтчетов.ФормаПриСозданииНаСервере(ЭтаФорма);
	//ИдентификаторГлавногоХранилища = Параметры.ИдентификаторГлавногоХранилища;
	//ИспользоватьДляВводаПлана = Параметры.ИспользоватьДляВводаПлана;
	//ВариантРасположенияГраницыФактическихДанных = Параметры.ВариантРасположенияГраницыФактическихДанных;
	//
	
	ОбновитьДеревоНовыхЭлементов(ЭтаФорма, Параметры);
	ДеревоОператоров = ПостроитьДеревоОператоров(Ложь);
	ЗначениеВРеквизитФормы(ДеревоОператоров, "Операторы");
	
	////ОбновитьЗаголовокФормы();
	//
	//Для Каждого СтрокаОперанда из ДанныеОбъекта.ОперандыФормулы Цикл
	//	НоваяСтрока = Операнды.Добавить();
	//	НоваяСтрока.ЭлементОтчета = СтрокаОперанда.Операнд;
	//	НоваяСтрока.Идентификатор = СтрокаОперанда.Идентификатор;
	//	НоваяСтрока.АдресСтруктурыЭлемента = СтрокаОперанда.АдресСтруктурыЭлемента;
	//	Если ЗначениеЗаполнено(НоваяСтрока.АдресСтруктурыЭлемента) Тогда
	//		ДанныеЭлемента = ПолучитьИзВременногоХранилища(НоваяСтрока.АдресСтруктурыЭлемента);
	//	Иначе
	//		ДанныеЭлемента = НоваяСтрока.ЭлементОтчета;
	//	КонецЕсли;
	//	БюджетнаяОтчетностьКлиентСервер.ЗаполнитьСтрокуСпискаЭлементовОтчета(ДанныеЭлемента, 
	//																		НоваяСтрока, 
	//																		НоваяСтрока.АдресСтруктурыЭлемента);
	//	НоваяСтрока.НестандартнаяКартинка = ФинансоваяОтчетностьПовтИсп.НестандартнаяКартинка(НоваяСтрока.ВидЭлемента);
	//КонецЦикла;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Функция ПостроитьДеревоОператоров(УсловиеДляЗапроса = Истина)
	Дерево = РаботаСФормулами.ПолучитьПустоеДеревоОператоров();
	
	ГруппаОператоров = РаботаСФормулами.ДобавитьГруппуОператоров(Дерево, НСтр("ru = 'Операторы'"));
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "+", " + ");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "-", " - ");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "*", " * ");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "/", " / ");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "( )", " ( ) ");
	
	Возврат Дерево;
КонецФункции

&НаСервере
// Процедура заполняет палитру новых элементов, доступных
// для выбора в экземпляре бюджета, форме конструктора формул
//
// Параметры:
//  Форма  - УправляемаяФорма - форма, для элементов которых
//                              производится заполнение
//  Параметры  - Структура - дополнительные параметры дерева
//
Процедура ОбновитьДеревоНовыхЭлементов(Форма, Параметры) Экспорт
	
	БыстрыйПоиск = Неопределено;
	ИмяЭлементаДерева = "ДеревоНовыхЭлементов";//ФинансоваяОтчетностьСервер.ПолучитьПараметр(Параметры,"ИмяЭлементаДерева");
	//БыстрыйПоиск = ФинансоваяОтчетностьСервер.ПолучитьПараметр(Параметры,"БыстрыйПоиск");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства.Ссылка КАК ЭлементОтчета,
	               |	УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства.Родитель КАК ЭлементВидаОтчетности,
	               |	УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства.Наименование,
	               |	УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства.ЭтоГруппа,
	               |	""Целевые показатели"" КАК ВидЭлемента,
	               |	ВЫБОР
	               |		КОГДА УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства.ЭтоГруппа
	               |			ТОГДА 42
	               |		ИНАЧЕ 9
	               |	КОНЕЦ КАК НестандартнаяКартинка
	               |ИЗ
	               |	Справочник.УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства КАК УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства
	               |ГДЕ
	               |	НЕ УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства.ПометкаУдаления
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	ДеревоЭлементов = Форма.РеквизитФормыВЗначение(ИмяЭлементаДерева);
	ДеревоЭлементов.Строки.Очистить();
	
	стрДерева=ДеревоЭлементов.Строки.Добавить();
	стрДерева.Наименование			= "Целевые показатели";
	стрДерева.НестандартнаяКартинка	= 9;
	РезультатыЗапроса = Запрос.Выполнить();
	
	// Создадим базовую структуру
		ФинансоваяОтчетностьСервер.РезультатЗапросаВДерево(РезультатыЗапроса,стрДерева);//МассивРезультатов[1], СтрокаПоказателей);
	//	Если ФинансоваяОтчетностьСервер.ПолучитьПараметр(Параметры, "ИспользоватьДляВводаПлана", Ложь) Тогда
	//		СтрокаПоказателей.ВидЭлемента = Неопределено;
	//	Иначе
	//		СтрокаПоказателей.ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ВсеСтатьиБюджетов;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//СтрокаПоказателей = ДеревоЭлементов.Строки.Найти(Перечисления.ВидыЭлементовФинансовогоОтчета.ПоказательБюджетов);
	//Если СтрокаПоказателей <> Неопределено Тогда
	//	СтрокаПоказателей.Наименование = НСтр("ru = 'Показатели бюджетов'");
	//	СтрокаПоказателей.ЭлементВидаОтчетности = Справочники.ПоказателиБюджетов.ПустаяСсылка();
	//	ФинансоваяОтчетностьСервер.РезультатЗапросаВДерево(МассивРезультатов[2], СтрокаПоказателей);
	//	Если ФинансоваяОтчетностьСервер.ПолучитьПараметр(Параметры, "ИспользоватьДляВводаПлана", Ложь) Тогда
	//		СтрокаПоказателей.ВидЭлемента = Неопределено;
	//	Иначе
	//		// Добавим показатели
	//		СтрокаПоказателей.ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ВсеПоказателиБюджетов;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//СтрокаПоказателей = ДеревоЭлементов.Строки.Найти(Перечисления.ВидыЭлементовФинансовогоОтчета.НефинансовыйПоказатель);
	//Если СтрокаПоказателей <> Неопределено Тогда
	//	СтрокаПоказателей.Наименование = НСтр("ru = 'Нефинансовые показатели'");
	//	СтрокаПоказателей.ЭлементВидаОтчетности = Справочники.НефинансовыеПоказателиБюджетов.ПустаяСсылка();
	//	СтрокаПоказателей.ВидЭлемента = Неопределено;
	//	ФинансоваяОтчетностьСервер.РезультатЗапросаВДерево(МассивРезультатов[3], СтрокаПоказателей);
	//КонецЕсли;
	//
	//// Добавим группировки
	//Если Параметры.РежимДерева = Перечисления.РежимыОтображенияДереваНовыхЭлементов.НастройкаВидаБюджета Тогда
	//	СтрокаГруппировки = ДеревоЭлементов.Строки.Найти(Перечисления.ВидыЭлементовФинансовогоОтчета.Измерение);
	//	Если Параметры.Свойство("АналитикиШапки") Тогда
	//		АналитикиШапки = Параметры.АналитикиШапки;
	//	Иначе
	//		АналитикиШапки = Новый Массив;
	//	КонецЕсли;
	//	ДобавитьИзмеренияВДеревоНовыхЭлементов(ДеревоЭлементов, СтрокаГруппировки, 
	//					Параметры.МодельБюджетирования, Параметры.ИспользоватьДляВводаПлана, АналитикиШапки);
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(БыстрыйПоиск) Тогда
	//	КопияДерева = ДеревоЭлементов.Скопировать();
	//	КопияДерева.Строки.Очистить();
	//	//отсортируем элементы отчета внутри видов
	//	//порядок видов элементов сохраним
	//	Для Каждого СтрокаДерева из ДеревоЭлементов.Строки Цикл
	//		СтрокаДерева.Строки.Сортировать("Наименование", Истина);
	//	КонецЦикла;
	//	ОтобратьЭлементыПоБыстромуПоиску(ДеревоЭлементов, КопияДерева, БыстрыйПоиск);
	//	ДеревоЭлементов = КопияДерева;
	//КонецЕсли;
	//
	Форма.ЗначениеВРеквизитФормы(ДеревоЭлементов, ИмяЭлементаДерева);
	
КонецПроцедуры

&НаСервере
функция ЭтоПредопределенныйЭлемент() 
	Возврат Объект.Предопределенный; 
КонецФункции	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазделыОператоров = Операторы.ПолучитьЭлементы();
	Если РазделыОператоров.Количество() > 0 Тогда
		Элементы.Операторы.Развернуть(РазделыОператоров[0].ПолучитьИдентификатор());
	КонецЕсли;
	
	Элементы.ФормаЗавершитьРедактирование.Видимость = Ложь;
	Элементы.ГруппаРедактированиеФормулы.Видимость	= Ложь;
	
	Если ЭтоПредопределенныйЭлемент() Тогда
		Элементы.РедактироватьФормулу.Доступность				= Ложь;
		Элементы.ВидПоказателя.Доступность						= Ложь;
		Элементы.СпособРасчетаЦелевыхПоказателей.Доступность	= Ложь;
	Иначе	
		Элементы.РедактироватьФормулу.Доступность				= Истина;
		Элементы.ВидПоказателя.Доступность						= Истина;
		Элементы.СпособРасчетаЦелевыхПоказателей.Доступность	= Истина;
	КонецЕсли;
	
КонецПроцедуры

//&НаСервере
//Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

//	Если НЕ Отказ Тогда
//		Справочники.ЭлементыФинансовыхОтчетов.ФормаПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, Отказ);
//		Если ЗначениеЗаполнено(ЭтаФорма.АдресЭлементаВХранилище) Тогда
//			СтруктураЭлемента = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресЭлементаВХранилище);
//			СтруктураЭлемента.ОперандыФормулы.Очистить();
//			Для Каждого СтрокаОперанда из Операнды Цикл
//				Если Не ЗначениеЗаполнено(СтрокаОперанда.АдресСтруктурыЭлемента) Тогда
//					СтрокаОперанда.АдресСтруктурыЭлемента = БюджетнаяОтчетностьКлиентСервер.ПоместитьЭлементВХранилище(СтрокаОперанда, ИдентификаторГлавногоХранилища);
//				КонецЕсли;
//				НоваяСтрокаОперанда = СтруктураЭлемента.ОперандыФормулы.Добавить();
//				ЗаполнитьЗначенияСвойств(НоваяСтрокаОперанда, СтрокаОперанда);
//				НоваяСтрокаОперанда.Операнд = СтрокаОперанда.ЭлементОтчета;
//			КонецЦикла;
//			ПоместитьВоВременноеХранилище(СтруктураЭлемента, ЭтаФорма.АдресЭлементаВХранилище);
//		КонецЕсли;
//	КонецЕсли;
	
//КонецПроцедуры

//&НаСервере
//Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
//	
//	ОбновитьЗаголовокФормы();
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//Если ЗначениеЗаполнено(АдресЭлементаВХранилище) Тогда
	//	СтандартнаяОбработка = Ложь;
		Если Модифицированность и Не ЗакрытиеФормы = Истина Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемОбработкаОповещения", ЭтаФорма);
			ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Все внесенные изменения будут потеряны. Закрыть форму?'"), РежимДиалогаВопрос.ДаНет);
			Отказ = Истина;
		КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//&НаКлиенте
//Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	ОбщегоНазначенияКлиент.ОткрытьФормуРедактированияКомментария(Элемент.ТекстРедактирования, Объект.Комментарий, Модифицированность);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура БыстрыйПоискНовыхПриИзменении(Элемент)
//	
//	ОбновитьДеревоНовыхЭлементов();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура БыстрыйПоискНовыхОчистка(Элемент, СтандартнаяОбработка)
//	
//	ОбновитьДеревоНовыхЭлементов();
//	
//КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицФормы

&НаКлиенте
Процедура ОператорыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Оператор) Тогда
		ПараметрыПеретаскивания.Значение = Элемент.ТекущиеДанные.Оператор;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	ДеревоОтправительСтроки = "Операторы";
	
КонецПроцедуры

&НаКлиенте
Процедура ОператорыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВставитьОператорВФормулу();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНовыхЭлементовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбранныеОперанды = Новый Массив;
	ВыбранныеОперанды.Добавить(Элемент.ТекущиеДанные);
	БюджетнаяОтчетностьКлиентСервер.ДобавитьОперандыФормулы(ЭтаФорма, ВыбранныеОперанды, Операнды, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНовыхЭлементовНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ДеревоОтправительСтроки = "ДеревоНовыхЭлементов";
	ТекущиеДанные = Элемент.ТекущиеДанные;      

	Если ТекущиеДанные = Неопределено        

		ИЛИ ТекущиеДанные.ЭтоГруппа Тогда
		Выполнение = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте                                     

Процедура ДеревоНовыхЭлементовОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	Если ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	//Если ЭтоПеретаскиваниеЯчейки(ПараметрыПеретаскивания.Значение) Тогда
		
	//	НовыеОперанды = БюджетнаяОтчетностьКлиент.ДобавитьОперандыФормулы(ЭтаФорма, ПараметрыПеретаскивания.Значение, Операнды, Истина);
	//	ЯчейкаТаблицы = ПредопределенноеЗначение("Перечисление.ВидыЭлементовФинансовогоОтчета.ЯчейкаТаблицы");
	//	
	//	Для Каждого НовыйОперанд из НовыеОперанды Цикл
	//		
	//		Если НовыйОперанд.ВидЭлемента <> "Целевые показатели" Тогда//ЯчейкаТаблицы Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		НовыйОперанд.АдресСтруктурыЭлемента = БюджетнаяОтчетностьКлиентСервер.ПоместитьЭлементВХранилище(НовыйОперанд, ИдентификаторГлавногоХранилища);
	//		
	//		ПараметрыФормы = Новый Структура();
	//		ПараметрыФормы.Вставить("ВидЭлемента", 						 ЯчейкаТаблицы);
	//		ПараметрыФормы.Вставить("ИспользоватьДляВводаПлана",		 ИспользоватьДляВводаПлана);
	//		ПараметрыФормы.Вставить("АдресТаблицыЭлементов", 			 АдресТаблицыЭлементов);
	//		ПараметрыФормы.Вставить("АдресЭлементовОтчета", 			 АдресЭлементовОтчета);
	//		ПараметрыФормы.Вставить("АдресЭлементаВХранилище", 			 НовыйОперанд.АдресСтруктурыЭлемента);
	//		ПараметрыФормы.Вставить("Операнд", 							 Операнды.Индекс(НовыйОперанд));
	//		Если РежимДерева = ПредопределенноеЗначение("Перечисление.РежимыОтображенияДереваНовыхЭлементов.НастройкаАвторасчетаСложнойТаблицы") Тогда
	//			ПараметрыФормы.Вставить("АдресРедактируемогоЭлемента", 		АдресРедактируемогоЭлемента);
	//		Иначе
	//			ПараметрыФормы.Вставить("АдресРедактируемогоЭлемента", 		АдресЭлементаВХранилище);
	//		КонецЕсли;
	//	
	//		Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораЯчейки", ЭтаФорма, ПараметрыФормы);
	//	
	//		ОткрытьФорму("Справочник.ЭлементыФинансовыхОтчетов.ФормаОбъекта",
	//						ПараметрыФормы, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//		
	//	КонецЦикла;
	//	
	//Иначе
		
		НовыеОперанды = БюджетнаяОтчетностьКлиентСервер.ДобавитьОперандыФормулы(ЭтаФорма, ПараметрыПеретаскивания.Значение, Операнды, Ложь);
		ФинансоваяОтчетностьКлиент.ДобавитьТекстФормулы(ЭтаФорма, НовыеОперанды);
		
	//КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОператорыОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
//	
//	ПараметрыФормы = Новый Структура();
//	ПараметрыФормы.Вставить("АдресТаблицыЭлементов", АдресТаблицыЭлементов);
//	ПараметрыФормы.Вставить("АдресЭлементовОтчета", АдресЭлементовОтчета);
//	Если ЗначениеЗаполнено(АдресРедактируемогоЭлемента) Тогда
//		ПараметрыФормы.Вставить("АдресРедактируемогоЭлемента", АдресРедактируемогоЭлемента);
//	Иначе
//		ПараметрыФормы.Вставить("АдресРедактируемогоЭлемента", АдресЭлементаВХранилище);
//	КонецЕсли;
//	Если Найти(ПараметрыПеретаскивания.Значение, "ИТОГ(") Тогда
//		Оповещение = Новый ОписаниеОповещения("ВыборТипаИтогаФормулы", ЭтаФорма);
//		ОткрытьФорму("Справочник.ЭлементыФинансовыхОтчетов.Форма.ВыборИзмеренийИтога",
//							ПараметрыФормы, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	ИначеЕсли Найти(ПараметрыПеретаскивания.Значение, "РАЗНОСТЬДАТ(") Тогда
//		Оповещение = Новый ОписаниеОповещения("ВыборПараметровРазностиДат", ЭтаФорма);
//		ОткрытьФорму("Справочник.ЭлементыФинансовыхОтчетов.Форма.ВыборПараметровРазностьДат",
//							ПараметрыФормы, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВыборТипаИтогаФормулы(Результат, ДополнительныеПараметры) Экспорт
//	
//	Если Результат <> Неопределено Тогда
//		ЭтаФорма.Элементы.Формула.ВыделенныйТекст = "ИТОГ(<Значение>, """ + Результат + """)";
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВыборПараметровРазностиДат(Результат, ДополнительныеПараметры) Экспорт
//	
//	Если Результат <> Неопределено Тогда
//		ЭтаФорма.Элементы.Формула.ВыделенныйТекст = "РАЗНОСТЬДАТ(" + 
//						Результат.НачалоПериода + ", " + 
//						Результат.КонецПериода + " , """ + 
//						Результат.Периодичность + """)";
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОперандыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
//	
//	Если ЭтоПеретаскиваниеЯчейки(ПараметрыПеретаскивания.Значение) Тогда
//		
//		НовыеОперанды = БюджетнаяОтчетностьКлиент.ДобавитьОперандыФормулы(ЭтаФорма, ПараметрыПеретаскивания.Значение, Операнды, Истина);
//		ЯчейкаТаблицы = ПредопределенноеЗначение("Перечисление.ВидыЭлементовФинансовогоОтчета.ЯчейкаТаблицы");
//		
//		Для Каждого НовыйОперанд из НовыеОперанды Цикл
//			
//			Если НовыйОперанд.ВидЭлемента <> ЯчейкаТаблицы Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			НовыйОперанд.АдресСтруктурыЭлемента = БюджетнаяОтчетностьКлиентСервер.ПоместитьЭлементВХранилище(НовыйОперанд, ИдентификаторГлавногоХранилища);
//			
//			ПараметрыФормы = Новый Структура();
//			ПараметрыФормы.Вставить("ВидЭлемента", 						 ЯчейкаТаблицы);
//			ПараметрыФормы.Вставить("ИспользоватьДляВводаПлана",		 ИспользоватьДляВводаПлана);
//			ПараметрыФормы.Вставить("АдресТаблицыЭлементов", 			 АдресТаблицыЭлементов);
//			ПараметрыФормы.Вставить("АдресЭлементовОтчета", 			 АдресЭлементовОтчета);
//			ПараметрыФормы.Вставить("АдресЭлементаВХранилище", 			 НовыйОперанд.АдресСтруктурыЭлемента);
//			ПараметрыФормы.Вставить("Операнд", 							 Операнды.Индекс(НовыйОперанд));
//			ПараметрыФормы.Вставить("НеУстанавливатьТекстФормулы", 		 Истина);
//			Если РежимДерева = ПредопределенноеЗначение("Перечисление.РежимыОтображенияДереваНовыхЭлементов.НастройкаАвторасчетаСложнойТаблицы") Тогда
//				ПараметрыФормы.Вставить("АдресРедактируемогоЭлемента", 		АдресРедактируемогоЭлемента);
//			Иначе
//				ПараметрыФормы.Вставить("АдресРедактируемогоЭлемента", 		АдресЭлементаВХранилище);
//			КонецЕсли;
//			
//			Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораЯчейки", ЭтаФорма, ПараметрыФормы);
//		
//			ОткрытьФорму("Справочник.ЭлементыФинансовыхОтчетов.ФормаОбъекта",
//							ПараметрыФормы, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//			
//		КонецЦикла;
//		
//	Иначе
//		
//		БюджетнаяОтчетностьКлиент.ДобавитьОперандыФормулы(ЭтаФорма, ПараметрыПеретаскивания.Значение, Операнды, Истина);
//		
//	КонецЕсли;
//	
//	//что бы не срабатывало события окончания перетаскивания дерева новых элементов
//	ПараметрыПеретаскивания.Значение.Очистить();
//	
//КонецПроцедуры

&НаКлиенте
Процедура ОперандыОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	Если ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ФинансоваяОтчетностьКлиент.ДобавитьТекстФормулы(ЭтаФорма, ПараметрыПеретаскивания.Значение);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОперандыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	
//	Если Поле.Имя <> "ПоказателиИдентификатор" Тогда
//		РедактироватьПоказатель();
//	КонецЕсли;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ОперандыИдентификаторОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	Текст = СокрЛП(Текст);
	НовыйИд = "[" + Текст + "]";
	СтарыйИд = "[" + Элементы.Операнды.ТекущиеДанные.Идентификатор + "2]";
	Формула = СтрЗаменить(Формула, СтарыйИд, НовыйИд);
	                                             
КонецПроцедуры

&НаКлиенте
Процедура ОперандыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ДеревоОтправительСтроки <> "ДеревоНовыхЭлементов" Тогда
		СтандартнаяОбработка = Ложь;             

		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОперандыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ДеревоОтправительСтроки = "Операнды";
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОперандыПриАктивизацииСтроки(Элемент)
//	
//	Элементы.ОперандыЗафиксироватьПоВертикали.Доступность = Ложь;
//	Элементы.ОперандыЗафиксироватьПоГоризонтали.Доступность = Ложь;
//	
//	ТекущиеДанные = Элементы.Операнды.ТекущиеДанные;
//	Если ТекущиеДанные <> Неопределено И
//		ТекущиеДанные.ВидЭлемента = ПредопределенноеЗначение("Перечисление.ВидыЭлементовФинансовогоОтчета.ЯчейкаТаблицы") Тогда
//		
//		Элементы.ОперандыЗафиксироватьПоВертикали.Доступность = Истина;
//		Элементы.ОперандыЗафиксироватьПоГоризонтали.Доступность = Истина;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	//ФинансоваяОтчетностьКлиент.ЗавершитьРедактированиеЭлементаОтчета(ЭтаФорма);
	
	//Для основной формы
	Элементы.ГруппаОсновнаяФорма.Доступность	= Истина;
	Элементы.ГруппаОсновнаяФорма.Видимость		= Истина;
	ЭтаФорма.КоманднаяПанель.Видимость			= Истина;
	ЭтаФорма.ПоложениеКоманднойПанели 			= ПоложениеКоманднойПанелиФормы.Авто;
	
	//для формы редактирования формул
	Элементы.ГруппаРедактированиеФормулы.Доступность	= Ложь;
	Элементы.ГруппаРедактированиеФормулы.Видимость		= Ложь;
	Элементы.ФормаЗавершитьРедактирование.Видимость		= Ложь;
	
	ПоместитьДанныеВОбъектНаСервере(Формула);
КонецПроцедуры

//&НаКлиенте
//Процедура НайтиНовыйЭлемент(Команда)
//	
//	ОбновитьДеревоНовыхЭлементов();
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФормулу(Команда)
	
	ОчиститьСообщения();
	Отказ = Ложь;
	ПроверитьФормулуСервер(Отказ);
	Если НЕ Отказ Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Синтаксических ошибок не обнаружено!'"));
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура РедактироватьОперанд(Команда)
//	
//	РедактироватьПоказатель();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
//	
//	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗафиксироватьПоГоризонтали(Команда)
//	
//	НеСмещатьПриКопированииНаСервере(Истина, Ложь);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗафиксироватьПоВертикали(Команда)
//	
//	НеСмещатьПриКопированииНаСервере(Ложь, Истина);
//	
//КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗакрытиемОбработкаОповещения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗакрытиеФормы = Истина;
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьФормулуСервер(Отказ)
	
	БюджетнаяОтчетностьВыводСервер.ПроверитьФормулу(Формула, Операнды.Выгрузить(), Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьОператорВФормулу()
	
	Если ЗначениеЗаполнено(Элементы.Операторы.ТекущиеДанные.Оператор) Тогда
		ТекстДляВставки = Элементы.Операторы.ТекущиеДанные.Оператор;
		Если Элементы.Операторы.ТекущиеДанные.Наименование = "( )" 
			И ЗначениеЗаполнено(Элементы.Формула.ВыделенныйТекст) Тогда
			ТекстДляВставки = "(" + Элементы.Формула.ВыделенныйТекст + ")";
		КонецЕсли;
		Элементы.Формула.ВыделенныйТекст = ТекстДляВставки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЯчейки(Результат, ДополнительныеПараметры) Экспорт
	
	Операнд = ДополнительныеПараметры.Операнд;
	Если Результат = Неопределено Тогда
		Операнды.Удалить(Операнд);
		Элементы.Формула.ВыделенныйТекст = "";
		Возврат;
	КонецЕсли;
	
	Операнд = Операнды[Операнд];
	Операнд.Идентификатор = Результат.ИмяЯчейки;
	
	Если НЕ ДополнительныеПараметры.Свойство("НеУстанавливатьТекстФормулы") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Операнд);
		ФинансоваяОтчетностьКлиент.ДобавитьТекстФормулы(ЭтаФорма, Массив);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоПеретаскиваниеЯчейки(Значение)
	
	Для Каждого СтрокаПеретаскивания из Значение Цикл
		Если СтрокаПеретаскивания.ВидЭлемента = "Целевые показатели" Тогда//ПредопределенноеЗначение("Перечисление.ВидыЭлементовФинансовогоОтчета.ЯчейкаТаблицы") Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура РедактироватьФормулу(Команда)
	
	//Для основной формы
	Элементы.ГруппаОсновнаяФорма.Доступность	= Ложь;
	Элементы.ГруппаОсновнаяФорма.Видимость		= Ложь;
	
	ЭтаФорма.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
	//ЭтаФорма.КоманднаяПанель.Видимость			= Ложь;
	//ЭтаФорма.КоманднаяПанель.Доступность		= Ложь;
	
	//Для формы редактирования формул
	Элементы.ГруппаРедактированиеФормулы.Доступность	= Истина;
	Элементы.ГруппаРедактированиеФормулы.Видимость		= Истина;
	Элементы.ФормаЗавершитьРедактирование.Видимость		= Истина;	
	
	ПоместитьДанныеДляРедактированияНаСервере();
КонецПроцедуры

//&НаКлиенте
//Процедура РедактироватьПоказатель()
//	
//	ТекущиеДанные = Элементы.Операнды.ТекущиеДанные;
//	
//	Если ПустаяСтрока(ТекущиеДанные.АдресСтруктурыЭлемента) Тогда
//		ТекущиеДанные.АдресСтруктурыЭлемента = БюджетнаяОтчетностьКлиентСервер.ПоместитьЭлементВХранилище(ТекущиеДанные, ИдентификаторГлавногоХранилища);
//	КонецЕсли;
//	
//	ПараметрыФормы = Новый Структура();
//	ПараметрыФормы.Вставить("Ключ", 							ТекущиеДанные.ЭлементОтчета);
//	ПараметрыФормы.Вставить("ВидЭлемента", 						ТекущиеДанные.ВидЭлемента);
//	ПараметрыФормы.Вставить("АдресЭлементаВХранилище", 			ТекущиеДанные.АдресСтруктурыЭлемента);
//	ПараметрыФормы.Вставить("ИдентификаторГлавногоХранилища", 	ИдентификаторГлавногоХранилища);
//	ПараметрыФормы.Вставить("ИспользоватьДляВводаПлана", 		ИспользоватьДляВводаПлана);
//	ПараметрыФормы.Вставить("ПроизвольныйПоказатель", 			Истина);
//	ПараметрыФормы.Вставить("АдресЭлементовОтчета", 			АдресЭлементовОтчета);
//	ПараметрыФормы.Вставить("АдресТаблицыЭлементов", 			АдресТаблицыЭлементов);
//	Если ЗначениеЗаполнено(АдресРедактируемогоЭлемента) Тогда
//		ПараметрыФормы.Вставить("АдресРедактируемогоЭлемента", АдресРедактируемогоЭлемента);
//	Иначе
//		ПараметрыФормы.Вставить("АдресРедактируемогоЭлемента", АдресЭлементаВХранилище);
//	КонецЕсли;
//	ПараметрыФормы.Вставить("ВариантРасположенияГраницыФактическихДанных", ВариантРасположенияГраницыФактическихДанных);
//	
//	Оповещение = Новый ОписаниеОповещения("ОбновитьСтрокуВидаБюджетаПослеИзменения", ЭтаФорма, ПараметрыФормы);
//	
//	ОткрытьФорму("Справочник.ЭлементыФинансовыхОтчетов.ФормаОбъекта",
//				ПараметрыФормы, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбновитьСтрокуВидаБюджетаПослеИзменения(Результат, ДополнительныеПараметры) Экспорт
//	
//	БюджетнаяОтчетностьКлиентСервер.ЗаполнитьСтрокуСпискаЭлементовОтчета(Результат, 
//													Элементы.Операнды.ТекущиеДанные,
//													ДополнительныеПараметры.АдресЭлементаВХранилище, 
//													Операнды);
//	
//КонецПроцедуры

//&НаСервере
//Процедура НеСмещатьПриКопированииНаСервере(ПоГоризонтали, ПоВертикали)
//	
//	СтрокаОперандов = Операнды.НайтиПоИдентификатору(Элементы.Операнды.ТекущаяСтрока);
//	Идентификатор = СтрокаОперандов.Идентификатор;
//	ПараметрыИдентификатора = Справочники.ЭлементыФинансовыхОтчетов.РазобратьИмяОперандаНаСоставляющие(Идентификатор);
//	
//	Если ПоГоризонтали Тогда
//		ПараметрыИдентификатора.КолонкаФиксированная = НЕ ПараметрыИдентификатора.КолонкаФиксированная;
//		Если Не ЗначениеЗаполнено(ПараметрыИдентификатора.Колонка) Тогда
//			ПараметрыИдентификатора.СтрокаФиксированная = ПараметрыИдентификатора.КолонкаФиксированная;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Если ПоВертикали Тогда
//		ПараметрыИдентификатора.СтрокаФиксированная = НЕ ПараметрыИдентификатора.СтрокаФиксированная;
//	КонецЕсли;
//	
//	Текст = ?(ПараметрыИдентификатора.СтрокаФиксированная, "$", "") + ПараметрыИдентификатора.Строка;
//	Если ЗначениеЗаполнено(ПараметрыИдентификатора.Колонка) Тогда
//		Текст = Текст + "; " + ?(ПараметрыИдентификатора.КолонкаФиксированная, "$", "") + ПараметрыИдентификатора.Колонка;
//	КонецЕсли;
//	
//	СтрокаОперандов.Идентификатор = Текст;
//	
//	Текст = СокрЛП(Текст);
//	НовыйИд = "[" + Текст + "]";
//	СтарыйИд = "[" + Идентификатор + "]";
//	Формула = СтрЗаменить(Формула, СтарыйИд, НовыйИд);
//	
//КонецПроцедуры

#КонецОбласти
